In [1]:
import numpy as np 
import pandas as pd

In [2]:
t = (1,2,3,4)
t[1:3]

(2, 3)

In [9]:
dictionary = {"name":["osman","yildiz","dilara","aleyna","sude","zeynep"],
             "age":[12,34,56,78,None,12],
             "note":[123,456,78,87654,None,89]}
dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

     name   age     note
0   osman  12.0    123.0
1  yildiz  34.0    456.0
2  dilara  56.0     78.0
3  aleyna  78.0  87654.0
4    sude   NaN      NaN
5  zeynep  12.0     89.0

In [11]:
df = pd.read_csv(r"C:\Users\osman\Downloads\data.csv")
print(df)

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\osman\\Downloads\\data.csv'

In [41]:
head = dataframe1.head() 
print(head)

     NAME   AGE     NOTE  BOOL  MEAN  new_age
0   osman  12.0    123.0  True   bad     24.0
1  yildiz  34.0    456.0  True   bad     68.0
2  dilara  56.0     78.0  True   bad    112.0
3  aleyna  78.0  87654.0  True  good    156.0
5  zeynep  12.0     89.0  True   bad     24.0

In [42]:
tail = dataframe1.tail()
print(tail)

     NAME   AGE     NOTE  BOOL  MEAN  new_age
0   osman  12.0    123.0  True   bad     24.0
1  yildiz  34.0    456.0  True   bad     68.0
2  dilara  56.0     78.0  True   bad    112.0
3  aleyna  78.0  87654.0  True  good    156.0
5  zeynep  12.0     89.0  True   bad     24.0

In [43]:
print(dataframe1.columns)

Index(['NAME', 'AGE', 'NOTE', 'BOOL', 'MEAN', 'new_age'], dtype='object')

In [44]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 0 to 5
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   NAME     5 non-null      object
 1   AGE      5 non-null      float64
 2   NOTE     5 non-null      float64
 3   BOOL     5 non-null      bool
 4   MEAN     5 non-null      object
 5   new_age  5 non-null      float64
dtypes: bool(1), float64(3), object(2)
memory usage: 245.0+ bytes
None

In [45]:
print(dataframe1.dtypes)

NAME        object
AGE        float64
NOTE       float64
BOOL          bool
MEAN        object
new_age    float64
dtype: object

In [ ]:
print(dataframe1["name"]) 
print(dataframe1.loc[:, "age"])            
dataframe1["new_future"] = [1,2,3,4,5,6] 
print(dataframe1.loc[:3,"age"])
print(dataframe1.loc[:3, "name":"note"])
print(dataframe1.loc[::-1])

In [ ]:
print(dataframe1.loc[:"new_feature"])

     name   age     note  new_future
0   osman  12.0    123.0           1
1  yildiz  34.0    456.0           2
2  dilara  56.0     78.0           3
3  aleyna  78.0  87654.0           4
4    sude   NaN      NaN           5
5  zeynep  12.0     89.0           6

In [ ]:
print(dataframe1.loc[:3, ["name","note"]])

     name     note
0   osman    123.0
1  yildiz    456.0
2  dilara     78.0
3  aleyna  87654.0

In [ ]:
print(dataframe1.loc[:,:"age"])

     name   age
0   osman  12.0
1  yildiz  34.0
2  dilara  56.0
3  aleyna  78.0
4    sude   NaN
5  zeynep  12.0

In [ ]:
print(dataframe1.iloc[:,[2]])

      note
0    123.0
1    456.0
2     78.0
3  87654.0
4      NaN
5     89.0

In [ ]:
filtre1 = dataframe1.age>10
dataframe1["bool"]= filtre1
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  12.0   True
1  34.0   True
2  56.0   True
3  78.0   True
4   NaN  False
5  12.0   True

In [ ]:
type(filtre1)

pandas.core.series.Series

In [ ]:
filtrelenmis_data= dataframe1[filtre1] 
print(filtrelenmis_data)

     name   age     note  new_future  bool
0   osman  12.0    123.0           1  True
1  yildiz  34.0    456.0           2  True
2  dilara  56.0     78.0           3  True
3  aleyna  78.0  87654.0           4  True
5  zeynep  12.0     89.0           6  True

In [ ]:
filtre2 = dataframe1.note>100
filtrelenmis_data2 = dataframe1[filtre2&filtre1] 
print(filtrelenmis_data2)

     name   age     note  new_future  bool
0   osman  12.0    123.0           1  True
1  yildiz  34.0    456.0           2  True
3  aleyna  78.0  87654.0           4  True

In [ ]:
dataframe1[dataframe1.age>20]

     name   age     note  new_future  bool
1  yildiz  34.0    456.0           2  True
2  dilara  56.0     78.0           3  True
3  aleyna  78.0  87654.0           4  True

In [ ]:
mean1 = dataframe1.note.mean()
print(mean1)
mean_np= np.mean(dataframe1.note) 
print(mean_np)

17680.0
17680.0

In [ ]:
dataframe1.dropna(inplace=True) 
dataframe1

     name   age     note  new_future  bool
0   osman  12.0    123.0           1  True
1  yildiz  34.0    456.0           2  True
2  dilara  56.0     78.0           3  True
3  aleyna  78.0  87654.0           4  True
5  zeynep  12.0     89.0           6  True

In [ ]:
print(dataframe1.note.mean())
dataframe1["mean"]= ["bad" if dataframe1.note.mean()>each else "good" for each in dataframe1.note]
dataframe1

17680.0

     name   age     note  new_future  bool  mean
0   osman  12.0    123.0           1  True   bad
1  yildiz  34.0    456.0           2  True   bad
2  dilara  56.0     78.0           3  True   bad
3  aleyna  78.0  87654.0           4  True  good
5  zeynep  12.0     89.0           6  True   bad

In [ ]:
dataframe1.columns = [each.upper() for each in dataframe1.columns] 

dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'NEW_FUTURE', 'BOOL', 'MEAN'], dtype='object')

In [ ]:
dataframe1.drop(["NEW_FUTURE"],axis=1,inplace=True)
dataframe1

     NAME   AGE     NOTE  BOOL  MEAN
0   osman  12.0    123.0  True   bad
1  yildiz  34.0    456.0  True   bad
2  dilara  56.0     78.0  True   bad
3  aleyna  78.0  87654.0  True  good
5  zeynep  12.0     89.0  True   bad

In [ ]:
data1 = dataframe1.head()     
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

     NAME   AGE     NOTE  BOOL  MEAN
0   osman  12.0    123.0  True   bad
1  yildiz  34.0    456.0  True   bad
2  dilara  56.0     78.0  True   bad
3  aleyna  78.0  87654.0  True  good
5  zeynep  12.0     89.0  True   bad
0   osman  12.0    123.0  True   bad
1  yildiz  34.0    456.0  True   bad
2  dilara  56.0     78.0  True   bad
3  aleyna  78.0  87654.0  True  good
5  zeynep  12.0     89.0  True   bad

In [ ]:
data_contact2 = pd.concat([data1,data2],axis=1)
data_contact2

     NAME   AGE     NOTE  BOOL  MEAN    NAME   AGE     NOTE  BOOL  MEAN
0   osman  12.0    123.0  True   bad   osman  12.0    123.0  True   bad
1  yildiz  34.0    456.0  True   bad  yildiz  34.0    456.0  True   bad
2  dilara  56.0     78.0  True   bad  dilara  56.0     78.0  True   bad
3  aleyna  78.0  87654.0  True  good  aleyna  78.0  87654.0  True  good
5  zeynep  12.0     89.0  True   bad  zeynep  12.0     89.0  True   bad

In [ ]:
dataframe1["new_age"] = [each*2 for each in dataframe1.AGE]
dataframe1

     NAME   AGE     NOTE  BOOL  MEAN  new_age
0   osman  12.0    123.0  True   bad     24.0
1  yildiz  34.0    456.0  True   bad     68.0
2  dilara  56.0     78.0  True   bad    112.0
3  aleyna  78.0  87654.0  True  good    156.0
5  zeynep  12.0     89.0  True   bad     24.0